[
  {
    "title": "Consultor",
    "image": "newshore.jpg",
    "website": "http://www.newshore.es",
    "place": "Newshore",
    "period": "nov. 2016 - jul. 2017 (9 months)",
    "description": "Leader of the development team (3 people) in the project of implementing an automated tests system with Selenium for the corporative website of Pobeda Airlines LLC (Aeroflot Group), using C#, the .NET implentation of Selenium and managing the development as BDD using Cucumber. The tests were run automatically by Jenkins.\n\nImplementation of a log system for the website and all the associated processes of Pobeda Airlines LLC, including the preparation of the tools for the visualization and analysis of these logs, using ElasticSearch and the full Elastic stack.\n\nPerformed maintenance tasks in the backend of the webpage (C#) and little modifications in the frontend (JavaScript).\n\nWorking environment consisting of agile methodology (SCRUM) using Jira, Microsoft Project y Git workflow. In the team we used the SOLID principles and we made code revisions, including the development of the unit tests needed with NUnit."
  },
  {
    "title": "Senior .NET developer",
    "image": "clinica_baviera.jpg",
    "website": "http://www.clinicabaviera.com",
    "place": "Clínica Baviera",
    "period": "may. 2016 - oct. 2017 (6 months)",
    "description": "Development of the customer fidelity project, including the creation of the web API with ASP.NET and the database design (MS-SQL).\n\nI performed also maintenance tasks in the centralized system in charge of the management of the clinics, using C# and Team Foundation Server (TFS) in a SCRUM environment."
  },
  {
    "title": "Senior developer",
    "image": "advantic_consultores.png",
    "website": "http://www.advantic.info",
    "place": "Advantic Consultores",
    "period": "nov. 2014 - abr. 2016 (1 year and 6 months)",
    "description": "Customized developments for the final client of Magento websites, with core modifications using PHP and deploy in production. Development during a year and a half of an Android application in the logistics bussiness with this functionalities:\n\n- Manage and show information about the current stock and its format to the delivery employee\n- Manage sales and orders\n- Manage users and its credentials\n- A catalog system so the delivery employments are able to sell new articles directly to the client\n- Syncronization with SAP and EKON, using a SOAP-based arquitecture with an API based on EntityFramework\n\nFor this project I designed and architecture based in SOAP web services using ASP.NET, with a middleware API that allowed the tablets to syncronize all the information with the implemented ERP.\n\nOther customized .NET and SAP projects were made too."
  },
  {
    "title": "Junior developer",
    "image": "cuchilleria_deportiva.png",
    "website": "https://www.cuchilleriadeportiva.es/",
    "place": "Cuchillería Deportiva S.L.",
    "period": "feb. 2014 - may. 2014 (4 months)",
    "description": "Web and mobile developer in a online selling company in Albacete. I performed multiple tasks like the development of other websites, improvements in the main website, SEO and SEM tasks and development of the mobile version of the site."
  },
  {
    "title": "Traineeship developer",
    "image": "grupo_delaware.png",
    "website": "http://www.grupodelaware.com/",
    "place": "Grupo Delaware",
    "period": "nov. 2013 - feb. 2014 (4 months)",
    "description": "Member of the development team in the project of the creation of a governmental website for the management of the unemployment benefits in Cantabria. The development was performed with web technologies in the Java environment (J2EE, Struts, Spring and Hibernate)."
  }
]

